cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'borkdude/brew'
tap 'd12frosted/emacs-plus'
tap 'fluxcd/tap'

brew 'awscli'
brew 'azure-cli'
brew 'babashka'
brew 'bzip2'
brew 'cfssl'
brew 'cmake'
brew 'coreutils'
brew 'emacs-plus@28', args: ["with-spacemacs-icon"], link: true
brew 'flux'
brew 'fzf'
brew 'gh'
brew 'glab'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'helm'
brew 'jenv'
brew 'jet'
brew 'jq'
brew 'jsonlint'
brew 'kcat'
brew 'kubectx', args: ["build-from-source"]
brew 'kube-ps1', args: ["build-from-source"]
brew 'leiningen'
brew 'mas'
brew 'nvm'
brew 'openjdk@11'
brew 'proselint'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'readline'
brew 'rust' # needed for vim-clap
brew 'stern'
brew 'svn'
brew 'tfenv'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'zlib'
brew 'zsh'
brew 'zsh-git-prompt'

cask 'arq'
cask 'confluent-cli'
cask 'docker'
cask 'font-fira-mono-nerd-font'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-aurulent-sans-mono-nerd-font'
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-code-new-roman-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-hasklug-nerd-font'
cask 'font-hurmit-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monoid-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-source-code-pro'
cask 'font-space-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'iterm2'
cask 'kaleidoscope'
cask 'notion'
cask 'prince'                 # installed for dendron to support PDF export
# cask 'steam'                # haven't played any steam games in awhile
cask 'transmit'
#cask 'viscosity'             # nice openvpn client, not using it anymore
cask 'visual-studio-code'

mas "1Password 7", id: 1333542190
mas "Navicat Premium Essentials", id: 1256997614
mas "OmniGraffle", id: 1142578753
mas "Slack", id: 803453959
mas "Reeder", id: 1529448980
mas "Xcode", id: 497799835
mas "Tailscale", id: 1475387142

