cask_args appdir: '/Applications'

tap '1password/tap'
tap 'borkdude/brew'
tap 'babashka/brew'
tap 'fluxcd/tap'
tap 'homebrew/cask-versions'
tap 'teamookla/speedtest'
tap 'temporalio/brew'
tap 'superbrothers/opener'

brew 'age'                                  # used by sops
brew 'awscli'
brew 'azure-cli'
brew 'babashka'
brew 'babashka/brew/bbin'
brew 'bzip2'
brew 'cfssl'
brew 'checkov'                              # IaC scanner/static analysis
brew 'clj-kondo'                            # clojure linting
brew 'clojure-lsp'
brew 'cmake'
brew 'coreutils'
brew 'difftastic'
brew 'direnv'
brew 'fd'                                   #fast find (for nvim telescope)
brew 'fluxcd/tap/flux@2.2'
brew 'fzf'
brew 'gh'
brew 'glab'
brew 'go'
brew 'goenv'
brew 'graphviz'
brew 'grc'
brew 'gum'
brew 'helm'
brew 'hg'
brew 'imagemagick'
brew 'jenv'
brew 'jet'
brew 'jq'
brew 'jsonlint'
brew 'kcat'
brew 'krew'
brew 'kubeconform'
brew 'kubectx', args: ["build-from-source"]
brew 'kube-ps1', args: ["build-from-source"]
brew 'lazygit'
brew 'leiningen'
brew 'libgit2'
brew 'luarocks'
brew 'lua-language-server'
brew 'mas'
brew 'mob'
brew 'mongodb-atlas-cli'
brew 'mongosh'
brew 'nvim'
brew 'nvm'
brew 'nvr'
brew 'openjdk@11'
brew 'parallel'
brew 'pngpaste'                            # for nvim obsidian plugin
brew 'proselint'
brew 'postgresql@14'
brew 'pgcli'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pwgen'
brew 'readline'
brew 'mob'
brew 'rust'                                 # for vim-clap
brew 'sops'
brew 'speedtest'
brew 'stern'
brew 'structurizr-cli'
brew 'superbrothers/opener/opener'
brew 'svn'
brew 'syncthing'
brew 'tectonic'                             # rendering latex
brew 'temporalio/brew/tcld'                 # temporal CLI
brew 'terraform-ls'
brew 'terraform'
#brew 'tfenv'
brew 'tflint'
brew 'tmux'
brew 'tree'
brew 'uv'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'zlib'
brew 'zsh'
brew 'zsh-git-prompt'

cask 'amazon-chime'
cask 'confluent-cli'
cask '1password'
cask '1password-cli'
cask 'arq'
#cask 'docker' # install not idempotent as of 2025-06-30
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-aurulent-sans-mono-nerd-font'
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-code-new-roman-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-hasklug-nerd-font'
cask 'font-hurmit-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monoid-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-source-code-pro'
cask 'font-space-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'gcloud-cli'
cask 'ghostty'
cask 'github'
cask 'google-chrome'
cask 'insomnia'
cask 'kaleidoscope'
cask 'multipass'
cask 'notion'
#cask 'obsidian'
cask 'prince'                  # installed for dendron to support PDF export
cask 'rectangle'               # tile and snap windows
cask 'session-manager-plugin'  # aws sesssion manager plugin
cask 'transmit'
cask 'visual-studio-code'
cask 'zprint'                  # clojure formatter

mas "Navicat Premium Essentials", id: 1256997614
mas "OmniGraffle", id: 1142578753
mas "Slack", id: 803453959
mas "Reeder", id: 1529448980
mas "Xcode", id: 497799835
mas "Tailscale", id: 1475387142

