cask_args appdir: '/Applications'

tap '1password/tap'
tap 'borkdude/brew'
tap 'fluxcd/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'remotemobprogramming/brew'


brew 'age'                                  # used by sops
brew 'aspell'                               # for emacs
brew 'awscli'
brew 'azure-cli'
brew 'babashka'
brew 'bzip2'
brew 'cfssl'
brew 'clj-kondo'                            # clojure linting
brew 'clojure-lsp'
brew 'cmake'
brew 'coreutils'
brew 'direnv'
brew 'fd'                                   #fast find (for nvim telescope)
brew 'findutils'                            #for emacs
brew 'flux'
brew 'fzf'
brew 'gh'
brew 'glab'
brew 'go'
brew 'goenv'
brew 'graphviz'
brew 'grc'
brew 'helm'
brew 'jenv'
brew 'jet'
brew 'jq'
brew 'jsonlint'
brew 'kcat'
brew 'kubeconform'
brew 'kubectx', args: ["build-from-source"]
brew 'kube-ps1', args: ["build-from-source"]
brew 'lazygit'
brew 'leiningen'
brew 'libvterm'                            # for emacs
brew 'lua-language-server'
brew 'mas'
brew 'mob'
brew 'nvim'
brew 'nvm'
brew 'openjdk@11'
brew 'proselint'
brew 'postgresql@14'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pwgen'
brew 'readline'
brew 'mob'
brew 'rg'                                   # for emacs
brew 'rust'                                 # for vim-clap
brew 'sops'
brew 'stern'
brew 'structurizr-cli'
brew 'svn'
brew 'terraform-ls'
brew 'tfenv'
brew 'tflint'
brew 'tmux'
brew 'tree'
brew 'unison'                              # for docker-sync
#brew 'vim', link: false
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'zlib'
brew 'zsh'
brew 'zsh-git-prompt'

cask '1password-cli'
cask 'arq'
cask 'confluent-cli'
cask 'docker'
cask 'emacs'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-aurulent-sans-mono-nerd-font'
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-code-new-roman-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-hasklug-nerd-font'
cask 'font-hurmit-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monoid-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-source-code-pro'
cask 'font-space-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'insomnia'
cask 'iterm2'
cask 'kaleidoscope'
cask 'notion'
#cask 'obsidian'
cask 'prince'                 # installed for dendron to support PDF export
cask 'session-manager-plugin'  # aws sesssion manager plugin
# cask 'steam'                # haven't played any steam games in awhile
cask 'transmit'
#cask 'viscosity'             # nice openvpn client, not using it anymore
cask 'visual-studio-code'
cask 'zprint'                 # clojure formatter

# mas "1Password 7", id: 1333542190   # 1password8
mas "Navicat Premium Essentials", id: 1256997614
mas "OmniGraffle", id: 1142578753
mas "Slack", id: 803453959
mas "Reeder", id: 1529448980
mas "Xcode", id: 497799835
mas "Tailscale", id: 1475387142

